Core/src/Catalogs/ВидыЗаказНарядов/ВидыЗаказНарядов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаказНарядов</name>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСостоянияВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВыполнения</name>
    <type>
      <types>CatalogRef.СостоянияЗаказНарядов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСостояний</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗаказНарядов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ВидыЗаказНарядов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ = ПорядокСостояний.Найти(Справочники.СостоянияЗаказНарядов.Завершен, "Состояние");
	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = ПорядокСостояний.Добавить();
		СтрокаТЧ.Состояние = Справочники.СостоянияЗаказНарядов.Завершен;
	Иначе
		ПорядокСостояний.Сдвинуть(СтрокаТЧ, ПорядокСостояний.Количество() - СтрокаТЧ.НомерСтроки);
	КонецЕсли;
	
	НомерСостоянияВыполнения = ПорядокСостояний.Найти(СостояниеВыполнения).НомерСтроки;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для НомерСтроки = 1 По ПорядокСостояний.Количество() Цикл
		Для НомерСтрокиОстатка = НомерСтроки+1 По ПорядокСостояний.Количество() Цикл
			Если ПорядокСостояний[НомерСтроки-1].Состояние = ПорядокСостояний[НомерСтрокиОстатка-1].Состояние Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон(НСтр("ka='Дублируется состояние ""%1"" в строках %2 и %3';ru='Дублируется состояние ""%1"" в строках %2 и %3';en='Duplicated state ""%1"" on lines 2% and 3%'"), ПорядокСостояний[НомерСтроки-1].Состояние, НомерСтроки, НомерСтрокиОстатка),
					ЭтотОбъект.Ссылка,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПорядокСостояний", НомерСтрокиОстатка, "Состояние"),
					,
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СостояниеВыполнения) И ПорядокСостояний.Найти(СостояниеВыполнения, "Состояние") = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ka='Выбранного состояния нет среди используемых в виде заказ-наряда.';ru='Выбранного состояния нет среди используемых в виде заказ-наряда.';en='Selected state is not among those used in the form of a purchase order.'"),
			,
			"СостояниеВыполнения",
			"Объект",
			Отказ
		);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
